import {Injectable} from '@angular/core';
import {HotToastService} from '@ngneat/hot-toast';
import {interval} from 'rxjs';

@Injectable({
  providedIn: 'root',
})
export class ToastService {
  private readonly toastMessages: string[] = ["سبحان الله وبحمده",
    "سبحان الله العظيم",
    "اللهم صل على محمد وعلى آل محمد",
    "اللهم صل وسلم على نبينا محمد",
    "اللهم إني أسألك علماً نافعاً ورزقاً طيباً وعملاً متقبلاً",
    "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
    "أستغفر الله وأتوب إليه",
    "الحمد لله رب العالمين",
    "لا حول ولا قوة إلا بالله",
    "اللهم لا مانع لما أعطيت ولا معطي لما منعت",
    "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين وغلبة الرجال",
    "اللهم إني أعوذ بك من جار السوء في المال وجار السوء في الأهل",
    "سبحان الله والحمد لله ولا إله إلا الله والله أكبر",
    "اللهم اهدني وسددني",
    "اللهم إني أعوذ بك من الشرور ما علمت وما لا أعلم",
    "اللهم إني أسألك العفو والعافية في الدنيا والآخرة",
    "اللهم إني أسألك الهدى والتقى والعفاف والغنى",
    "اللهم إني أعوذ بك من الفقر والقلة",
    "اللهم اغفر لي وارحمني واهدني وارزقني",
    "اللهم إني أعوذ بك من جهد البلاء ودرك الشقاء وسوء القضاء وشماتة الأعداء",
    "اللهم إني أسألك عيشة هنية وميتة سوية ومرداً غير مخزٍ في الدنيا والآخرة",
    "اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين وغلبة الرجال",
    "اللهم إني أعوذ بك من عذاب في النار وعذاب في القبر",
    "اللهم إني أعوذ بك من السفر، والجوء، والكلب",
    "اللهم إني أعوذ بك من السلب بعد العطاء",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أسألك الصحة والعافية والأمان والهمة العالية في الدين والدنيا",
    "اللهم إني أعوذ بك من الجبن، والبخل، والهمة الضعيفة، وسوء القضاء، وغلبة الدين، وفقر العلم",
    "اللهم إني أعوذ بك من العين السوء والحسد",
    "اللهم إني أسألك حسن الخاتمة والمغفرة في الدنيا والآخرة",
    "اللهم إني أسألك العفو والعافية في الدين والدنيا والأهل والمال",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أعوذ بك من السفر، والجوء، والكلب",
    "اللهم إني أعوذ بك من السلب بعد العطاء",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أسألك الصحة والعافية والأمان والهمة العالية في الدين والدنيا",
    "اللهم إني أعوذ بك من الجبن، والبخل، والهمة الضعيفة، وسوء القضاء، وغلبة الدين، وفقر العلم",
    "اللهم إني أعوذ بك من العين السوء والحسد",
    "اللهم إني أسألك حسن الخاتمة والمغفرة في الدنيا والآخرة",
    "اللهم إني أسألك العفو والعافية في الدين والدنيا والأهل والمال",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أعوذ بك من السفر، والجوء، والكلب",
    "اللهم إني أعوذ بك من السلب بعد العطاء",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أسألك الصحة والعافية والأمان والهمة العالية في الدين والدنيا",
    "اللهم إني أعوذ بك من الجبن، والبخل، والهمة الضعيفة، وسوء القضاء، وغلبة الدين، وفقر العلم",
    "اللهم إني أعوذ بك من العين السوء والحسد",
    "اللهم إني أسألك حسن الخاتمة والمغفرة في الدنيا والآخرة",
    "اللهم إني أسألك العفو والعافية في الدين والدنيا والأهل والمال",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم إني أعوذ بك من السفر، والجوء، والكلب",
    "اللهم إني أعوذ بك من السلب بعد العطاء",
    "اللهم إني أعوذ بك من زوال نعمتك وتحول عافيتك وفجاءة نقمتك وجميع سخطك",
    "اللهم اشرح صدري",
    "اللهم اجعلني من التوابين",
    "اللهم اجعلني من المتطهرين",
    "اللهم اجعلني من المتوكلين",
    "اللهم اجعلني من المتقين",
    "اللهم اجعلني من المؤمنين",
    "اللهم اجعلني من المحسنين",
    "اللهم اجعلني من المستغفرين",
    "اللهم اجعلني من المستقيمين",
    "اللهم اجعلني من الصابرين",
    "اللهم اجعلني من الصالحين",
    "اللهم اجعلني من الصائمين",
    "اللهم اجعلني من الذاكرين",
    "اللهم اجعلني من العابدين",
    "اللهم اجعلني من الفائزين",
    "اللهم اجعلني من الفرحين",
    "اللهم اجعلني من القانتين",
    "اللهم اجعلني من الكثرة الذاكرين",
    "اللهم اجعلني من اللذين يستمعون القول فيتبعون أحسنه",
    "اللهم اجعلني من اللذين يستغفرون",
    "اللهم اجعلني من اللذين يصلون",
    "اللهم اجعلني من اللذين يعطون الزكاة",
    "اللهم اجعلني من اللذين يتصدقون",
    "اللهم اجعلني من اللذين يتوبون",
    "اللهم اجعلني من اللذين يحسنون الظن",
    "اللهم اجعلني من اللذين يحسنون الخلق",
    "اللهم اجعلني من اللذين يحسنون العمل",
    "اللهم اجعلني من اللذين يحسنون القول",
    "اللهم اجعلني من اللذين يحسنون الصبر",
    "اللهم اجعلني من اللذين يحسنون العبادة",
    "اللهم اجعلني من اللذين يحسنون الإخلاص",
    "اللهم اجعلني من اللذين يحسنون الإحسان",
    "اللهم اجعلني من اللذين يحسنون الإستغفار",
    "اللهم اجعلني من اللذين يحسنون الإستعانة",
  ];

  constructor(private toast: HotToastService) {
    setTimeout(() => {
      this.init();
    }, 6000)
  }

  private init() {
    this.showRandomToast();

    interval(30000).subscribe(() => {
      this.showRandomToast();
    });
  }

  private getRandomMessage(): string {
    const randomIndex = Math.floor(Math.random() * this.toastMessages.length);
    return this.toastMessages[randomIndex];
  }

  private showToast(message: string): void {
    this.toast.close()
    this.toast.info(message, {duration: 5000, theme: "snackbar", className: 'print:hidden'});
  }

  private showRandomToast(): void {
    const randomMessage = this.getRandomMessage();
    this.showToast(randomMessage);
  }
}
